src/Documents/Scan_ПеремещениеИзделий/Scan_ПеремещениеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ПеремещениеИзделий</name>
  <comment>Перемещение продуктов  (scania)</comment>
  <basedOn>Document.Scan_ЗаявкаНаДействие</basedOn>
  <registerRecords>AccumulationRegister.Scan_МестонахождениеИзделий</registerRecords>
  <registerRecords>AccumulationRegister.Scan_ЗаявкиНаДействия</registerRecords>
  <registerRecords>InformationRegister.Scan_ОстаткиПродуктовНаПлощадках</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОтгрузки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <comment>удалить</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоДоставки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <comment>удалить</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзделияДляПеремещения</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПолучения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Scan_МестонахождениеИзделий/Scan_МестонахождениеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Scan_МестонахождениеИзделий</name>
  <comment>Местонахождение продуктов (scania)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <type>
      <types>CatalogRef.Scan_ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Scan_ПеремещениеИзделий/ObjectModule.bsl
//rarus tenkam 13.09.2018 mantis 13495 +++
//Перем ЭтоОтменаПроведения; 		//rarus tenkam 23.03.2017 mantis 7179 +
Перем ТекРежимЗаписиДокумента; 		
//rarus tenkam 13.09.2018 mantis 13495 ---

//rarus sergei 09.11.2016 mantis 7163 ++
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus tenkam 28.12.2016 TLMS 7750 ++
	Если ЭтоНовый() Тогда
		ХозОперация = ?(ЗначениеЗаполнено(ХозОперация), ХозОперация, Справочники.Scan_ХозяйственныеОперации.ПеремещениеИзделий);
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь() ;
	   	Организация = ?(ЗначениеЗаполнено(Организация), Организация,ТекущийПользователь.Организация);
		ПодразделениеКомпании =  ?(ЗначениеЗаполнено(ПодразделениеКомпании), ПодразделениеКомпании,ТекущийПользователь.ПодразделениеОрганизации);
		Автор = ?(ЗначениеЗаполнено(Автор), Автор, ТекущийПользователь);
		Менеджер = ?(ЗначениеЗаполнено(Менеджер), Менеджер, ТекущийПользователь);
		Дата = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата());
		ВалютаДокумента = ?(ЗначениеЗаполнено(ВалютаДокумента), ВалютаДокумента,Справочники.Валюты.НайтиПоКоду("643"));
	КонецЕсли;
	//rarus tenkam 28.12.2016 mantis 7750 --
	
	//rarus tenkam 13.09.2018 mantis 13495 +++
	////rarus tenkam 23.03.2017 mantis 7179 +++
	//ЭтоОтменаПроведения = (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения); 
	////rarus tenkam 23.03.2017 mantis 7179 ---
	ТекРежимЗаписиДокумента = РежимЗаписи;
	//rarus tenkam 13.09.2018 mantis 13495 ---
	 
	// rarus tenkam 25.04.2018 mantis 13020 +++
	Если НЕ Ссылка.ПометкаУдаления И ПометкаУдаления И
		Ссылка.Проведен Тогда	// rarus tenkam 09.04.2019 mantis 14334 +
		ЕстьДвижения = Ложь;
		Для Каждого ТекСтрока Из ИзделияДляПеремещения Цикл
			ЕстьДвижения = РегистрыНакопления.Scan_МестонахождениеИзделий.ЕслиДвиженияПослеРегистратора(ТекСтрока.Изделие, Ссылка, ТекСтрока.ДатаПолучения);
			Если ЕстьДвижения Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьДвижения Тогда
			Отказ = Истина;
			Сообщить("У продуктов документа есть перемещения, созданные позже даты прихода"); 
		КонецЕсли;			
	КонецЕсли;
	// rarus tenkam 25.04.2018 mantis 13020 ---
	
	//rarus vikhle 01.12.2020 mt 16823 +++
	Если Не Отказ И ИзделияДляПеремещения.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(ИзделияДляПеремещения.Изделие КАК Справочник.Scan_Изделия) КАК Изделие,
		               |	ИзделияДляПеремещения.ДатаПолучения КАК ДатаПолучения,
		               |	ИзделияДляПеремещения.ДатаДоставки КАК ДатаДоставки
		               |ПОМЕСТИТЬ ИзделияДляПеремещения
		               |ИЗ
		               |	&ИзделияДляПеремещения КАК ИзделияДляПеремещения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИзделияДляПеремещения.Изделие КАК Изделие,
		               |	ИзделияДляПеремещения.ДатаПолучения КАК ДатаПолучения,
		               |	ИзделияДляПеремещения.ДатаДоставки КАК ДатаДоставки
		               |ИЗ
		               |	ИзделияДляПеремещения КАК ИзделияДляПеремещения
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ИзделияДляПеремещения.Изделие.НомерИзделия";
		Запрос.УстановитьПараметр("ИзделияДляПеремещения",ИзделияДляПеремещения.Выгрузить());
		ОтсортированнаяТЗ = Запрос.Выполнить().Выгрузить();
		ИзделияДляПеремещения.Загрузить(ОтсортированнаяТЗ);
	КонецЕсли;	
	//rarus vikhle 01.12.2020 mt 16823 ---
	
КонецПроцедуры
//rarus sergei 09.11.2016 mantis 7163 --

//rarus tenkam 05.10.2016 mantis 7183 ++
Процедура ОбработкаПроведения(Отказ, Режим)
	//rarus tenkam 21.03.2017 mantis 9109 +++
	//НаборЗаписейМестонахождениеИзделий = РегистрыНакопления.Scan_МестонахождениеИзделий.СоздатьНаборЗаписей();
	//НаборЗаписейМестонахождениеИзделий.Отбор.Регистратор.Значение = Ссылка;
	//НаборЗаписейМестонахождениеИзделий.Очистить();
	//НаборЗаписейМестонахождениеИзделий.ДополнительныеСвойства.Вставить("ОчисткаПередЗаписью", Истина);	//rarus tenkam 05.03.2017 mantis 6897 +
	//НаборЗаписейМестонахождениеИзделий.Записать();
	//rarus tenkam 21.03.2017 mantis 9109 ---
	Движения.Scan_МестонахождениеИзделий.Записывать = Истина;
	
	Для Индекс = 0 по ИзделияДляПеремещения.Количество()-1 Цикл
		СтрокаИзделия = ИзделияДляПеремещения.Получить(Индекс);
		//rarus tenkam 21.03.2017 mantis 9109 +++
		//МестоположениеИзделия = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьМестоположениеИзделия(СтрокаИзделия.Изделие, СтрокаИзделия.ДатаПолучения);
		ДанныеМестоположения = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьДанныеПоМестонахождениюИзделия(СтрокаИзделия.Изделие, СтрокаИзделия.ДатаПолучения, Ссылка);
		МестоположениеИзделия = ?(ДанныеМестоположения = Неопределено, Неопределено, ДанныеМестоположения.МестоХранения);
		//rarus tenkam 21.03.2017 mantis 9109 ---
		
		Если МестоположениеИзделия <> МестоОтгрузки Тогда
			Сообщение = Новый СообщениеПользователю();
			Если НЕ ЗначениеЗаполнено(МестоположениеИзделия) Тогда
				Сообщение.Текст = "В строке " + (Индекс+1) + " изделие на дату отгрузки не находится в месте хранения";
			Иначе
				Сообщение.Текст = "В строке " + (Индекс+1) + " изделие на дату отгрузки находится на " + МестоположениеИзделия;
			КонецЕсли;
			
			Сообщение.Поле = "ИзделияДляПеремещения[" + Индекс + "].Изделие";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

	Если НЕ Отказ Тогда
		//rarus tenkam 16.01.2017 mantis 8172 ++
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Scan_ЗаявкаНаДействие") Тогда
			Для Каждого ТекСтрокаИзделияДляПеремещения Из ИзделияДляПеремещения Цикл
				Если ЗначениеЗаполнено(ТекСтрокаИзделияДляПеремещения.ДатаПолучения) И ЗначениеЗаполнено(ТекСтрокаИзделияДляПеремещения.ДатаДоставки) Тогда	
					
					//rarus tenkam 21.03.2017 mantis 9109 +++
					//МестонахождениеИзделия = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьМестонахождениеИДатуПриходаИзделия(СтрокаИзделия.Изделие, КонецДня(ТекСтрокаИзделияДляПеремещения.ДатаПолучения));
					ДанныеМестоположения = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьДанныеПоМестонахождениюИзделия(ТекСтрокаИзделияДляПеремещения.Изделие, КонецДня(ТекСтрокаИзделияДляПеремещения.ДатаПолучения), Ссылка);
					МестоположениеИзделия = ?(ДанныеМестоположения = Неопределено, Неопределено, ДанныеМестоположения.МестоХранения);
					ДатаПриходаИзделия = ?(ДанныеМестоположения = Неопределено, Дата('00010101'), ДанныеМестоположения.ДатаПрихода); 
					//rarus tenkam 21.03.2017 mantis 9109 ---
		
					//Расход
					Движение = Движения.Scan_МестонахождениеИзделий.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = ТекСтрокаИзделияДляПеремещения.ДатаПолучения;
					Движение.Изделие = ТекСтрокаИзделияДляПеремещения.Изделие;
					Движение.МестоХранения = МестоОтгрузки;
					//rarus tenkam 21.03.2017 mantis 9109 +++
					//Движение.ДатаПрихода = МестонахождениеИзделия.ДатаПрихода;
					Движение.ДатаПрихода = ДатаПриходаИзделия;
					//rarus tenkam 21.03.2017 mantis 9109 +++
					Движение.Количество = 1;
					Движение.ХозОперация = ХозОперация;
					Движение.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
					
					//Приход
					Движение = Движения.Scan_МестонахождениеИзделий.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = ТекСтрокаИзделияДляПеремещения.ДатаДоставки;
					Движение.Изделие = ТекСтрокаИзделияДляПеремещения.Изделие;
					Движение.МестоХранения = МестоДоставки;
					Движение.ДатаПрихода = ТекСтрокаИзделияДляПеремещения.ДатаДоставки;
					Движение.Количество = 1;
					Движение.ХозОперация = ХозОперация;
					Движение.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
				КонецЕсли;
			КонецЦикла;
		Иначе
		//rarus tenkam 16.01.2017 mantis 8172 --
			// регистр Scan_МестонахождениеИзделий Расход
			Для Каждого ТекСтрокаИзделияДляПеремещения Из ИзделияДляПеремещения Цикл
				//rarus tenkam 21.03.2017 mantis 9109 +++
				//МестонахождениеИзделия = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьМестонахождениеИДатуПриходаИзделия(СтрокаИзделия.Изделие, СтрокаИзделия.ДатаПолучения);
				ДанныеМестоположения = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьДанныеПоМестонахождениюИзделия(ТекСтрокаИзделияДляПеремещения.Изделие, ТекСтрокаИзделияДляПеремещения.ДатаПолучения, Ссылка);
				МестоположениеИзделия = ?(ДанныеМестоположения = Неопределено, Неопределено, ДанныеМестоположения.МестоХранения);
				ДатаПриходаИзделия = ?(ДанныеМестоположения = Неопределено, Дата('00010101'), ДанныеМестоположения.ДатаПрихода); 
				//rarus tenkam 21.03.2017 mantis 9109 ---
				
				//Расход
				Движение = Движения.Scan_МестонахождениеИзделий.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				//Движение.Период = ДатаОтгрузки;
				Движение.Период = ТекСтрокаИзделияДляПеремещения.ДатаПолучения;
				Движение.Изделие = ТекСтрокаИзделияДляПеремещения.Изделие;
				Движение.МестоХранения = МестоОтгрузки;
				//rarus tenkam 21.03.2017 mantis 9109 +++
				//Движение.ДатаПрихода = МестонахождениеИзделия.ДатаПрихода;
				Движение.ДатаПрихода = ДатаПриходаИзделия;
				//rarus tenkam 21.03.2017 mantis 9109 +++
				Движение.Количество = 1;
				Движение.ХозОперация = ХозОперация;
				Движение.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
			КонецЦикла;
			
			// регистр Scan_МестонахождениеИзделий Приход
			Для Каждого ТекСтрокаИзделияДляПеремещения Из ИзделияДляПеремещения Цикл
				Движение = Движения.Scan_МестонахождениеИзделий.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				//rarus tenkam 23.02.2017 mantis 8492 +++
				Движение.Период = ТекСтрокаИзделияДляПеремещения.ДатаДоставки;
				//Движение.Период = ДатаДоставки;
				//rarus tenkam 23.02.2017 mantis 8492 ---
				Движение.Изделие = ТекСтрокаИзделияДляПеремещения.Изделие;
				Движение.МестоХранения = МестоДоставки;
				//rarus tenkam 23.02.2017 mantis 8492 +++
				//Движение.ДатаПрихода = ДатаДоставки;
				Движение.ДатаПрихода = ТекСтрокаИзделияДляПеремещения.ДатаДоставки;
				//rarus tenkam 23.02.2017 mantis 8492 ---
				Движение.Количество = 1;
				Движение.ХозОперация = ХозОперация;
				Движение.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//rarus tenkam 16.01.2017 mantis 8172 ++
	//rarus tenkam 27.02.2017 mantis 8492 +++
	//Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Scan_ЗаявкаНаДействие") Тогда
	//	ИндексДляУдаления = ПроверяемыеРеквизиты.Найти("ДатаОтгрузки");
	//	ПроверяемыеРеквизиты.Удалить(ИндексДляУдаления);
	//	ИндексДляУдаления = ПроверяемыеРеквизиты.Найти("ДатаДоставки");
	//	ПроверяемыеРеквизиты.Удалить(ИндексДляУдаления);
	//rarus tenkam 27.02.2017 mantis 8492 ---
	Для Индекс = 0 по ИзделияДляПеремещения.Количество()-1 Цикл
		СтрокаИзделия = ИзделияДляПеремещения.Получить(Индекс);
		Если ЗначениеЗаполнено(СтрокаИзделия.ДатаДоставки) И СтрокаИзделия.ДатаПолучения > СтрокаИзделия.ДатаДоставки Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + (Индекс+1) + " дата получения меньше даты доставки!";
			Сообщение.Поле = "ИзделияДляПеремещения[" + Индекс + "].Изделие";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если СтрокаИзделия.ДатаДоставки > ТекущаяДата() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + (Индекс+1) + " дата доставки больше текущей даты!";
			//rarus tenkam 06.03.2017 TLMS 011 +++
			//Сообщение.Поле = "ДатаДоставки";
			Сообщение.Поле = "ИзделияДляПеремещения[" + Индекс + "].ДатаДоставки";
			//rarus tenkam 06.03.2017 TLMS 011 ---
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;			
		КонецЕсли;
		
		//rarus tenkam 06.03.2017 mantis 6897 +++
		Если НЕ ЗначениеЗаполнено(СтрокаИзделия.ДатаПолучения) И НЕ ЗначениеЗаполнено(СтрокаИзделия.ДатаДоставки) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + (Индекс+1) + " дата получения и дата доставки не заполнены!";
			Сообщение.Поле = "ИзделияДляПеремещения[" + Индекс + "].ДатаПолучения";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;

		//rarus tenkam 06.03.2017 mantis 6897 ---
	КонецЦикла;
	//rarus tenkam 27.02.2017 mantis 8492 +++	
	//Иначе
	//	Если ДатаОтгрузки > ДатаДоставки Тогда
	//		Сообщить("Дата отгрузки меньше даты доставки!");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//	Если ДатаДоставки > ТекущаяДата() Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		Сообщение.Текст = "Дата доставки больше текущей даты!";
	//		Сообщение.Поле = "ДатаДоставки";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		Отказ = Истина;			
	//	КонецЕсли;
	//КонецЕсли;
	//rarus tenkam 27.02.2017 mantis 8492 ---
	Если МестоОтгрузки = МестоДоставки И ЗначениеЗаполнено(МестоДоставки) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Место доставки совпадает с местом отгрузки!";
		Сообщение.Поле = "МестоДоставки";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если ИзделияДляПеремещения.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Табличная часть пустая!";
		Сообщение.Поле = "ИзделияДляПеремещения";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;

	//rarus tenkam 20.03.2017 mantis 9061 +++
	//Для Индекс = 0 по ИзделияДляПеремещения.Количество()-1 Цикл
	//	СтрокаИзделия = ИзделияДляПеремещения.Получить(Индекс);
	//	Если ИзделиеЕстьВЗаявках(СтрокаИзделия.Изделие) Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		Сообщение.Текст = "В строке " + (Индекс+1) + " по изделию есть проведенные заявки!";
	//		Сообщение.Поле = "ИзделияДляПеремещения[" + Индекс + "].Изделие";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//rarus tenkam 20.03.2017 mantis 9061 ---

	
	//rarus tenkam 13.10.2016 mantis 7688 ++
	// Проверка на одинаковые изделия в ТЧ
	НоваяТЗ = Новый ТаблицаЗначений;
	НоваяТЗ.Колонки.Добавить("Изделие");
	НоваяТЗ.Колонки.Добавить("Количество");
	Для Каждого СтрокаТЗ Из ИзделияДляПеремещения Цикл
		НоваяСтрока = НоваяТЗ.Добавить();
		НоваяСтрока.Изделие = СтрокаТЗ.Изделие;
		НоваяСтрока.Количество = 1;	
	КонецЦикла;
	НоваяТЗ.Свернуть("Изделие","Количество");
	Для Каждого СтрокаТЗ Из НоваяТЗ Цикл;
		Если СтрокаТЗ.Количество <> 1 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В табличной части одинаковые изделия " + СтрокаТЗ.Изделие;
			Сообщение.Поле = "ИзделияДляПеремещения";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
		//rarus tenkam 13.10.2016 mantis 7688 --
КонецПроцедуры

//// Функция проверяет, есть ли проведенные заявки, в которых указано изделие
//Функция ИзделиеЕстьВЗаявках(ИзделиеСсылка)
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	Scan_КорректировкаИнформацииПоЗаявкам.Изделие
//	               |ИЗ
//	               |	РегистрСведений.Scan_КорректировкаИнформацииПоЗаявкам КАК Scan_КорректировкаИнформацииПоЗаявкам
//	               |ГДЕ
//	               |	Scan_КорректировкаИнформацииПоЗаявкам.Изделие = &ИзделиеСсылка";
//	Запрос.УстановитьПараметр("ИзделиеСсылка", ИзделиеСсылка);
//	Возврат (НЕ Запрос.Выполнить().Пустой());
//КонецФункции
////rarus tenkam 05.10.2016 mantis 7183 --

// rarus tenkam 16.01,2017 mantis 8172 ++
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Scan_ЗаявкаНаДействие") Тогда

		Если ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
			//rarus tenkam 08.02.2017 mantis 8331 +++
			ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ
			ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ
			//rarus tenkam 08.02.2017 mantis 8331 ---
			ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
			ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
			ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК ИЛИ 		//rarus tenkam 26.09.2017 mantis 10742 +
			ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
			ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК ИЛИ
			ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь ИЛИ		//rarus tenkam 15.08.2017 mantis 9319 +			
			ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу Тогда
			ВызватьИсключение "Запрещен ввод на основании для текущей хозяйственной операции!";
		КонецЕсли;
		
		Если НЕ Scan_ВспомогательныеФункцииСервер.НетПеремещений(ДанныеЗаполнения.Ссылка) Тогда
			ВызватьИсключение "На основании этой заявки уже создано перемещение!";	
		КонецЕсли;
		
		Если ДанныеЗаполнения.СтатусЗаявки <> Справочники.Scan_СтатусыЗаявокНаДействие.ВРаботе Тогда
			ВызватьИсключение "Для создания перемещения необходимо, чтобы заявка была ""В работе""!";	
		КонецЕсли;
		
		// Заполнение шапки
		МестоДоставки = ДанныеЗаполнения.МестоДоставки;
		МестоОтгрузки = ДанныеЗаполнения.МестоПолучения;
		
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ДатаСоздания = ТекущаяДата();
		Для Каждого ТекСтрокаПродуктыПоЗаявке Из ДанныеЗаполнения.ПродуктыПоЗаявке Цикл
			НоваяСтрока = ИзделияДляПеремещения.Добавить();
			НоваяСтрока.Изделие = ТекСтрокаПродуктыПоЗаявке.Изделие;
			НоваяСтрока.ДатаПолучения = ДанныеЗаполнения.ДатаИВремяПоручения;
			Если ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство ИЛИ
				ДанныеЗаполнения.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство Тогда
				НоваяСтрока.ДатаДоставки = НоваяСтрока.ДатаПолучения + 10;
			КонецЕсли;
		КонецЦикла;
		Комментарий = "Документ создан на основании заявки на действие №" + ДанныеЗаполнения.Номер;
	КонецЕсли;
КонецПроцедуры
//rarus tenkam 16.01.2017 mantis 8172 --

//rarus tenkam 23.03.2017 mantis 7179 +++
Процедура ПриЗаписи(Отказ)
	// rarus tenkam 13.09.2018 mantis 13495 +++
	//Если ЭтоОтменаПроведения Тогда
	Если ТекРежимЗаписиДокумента = РежимЗаписиДокумента.ОтменаПроведения Тогда
	// rarus tenkam 13.09.2018 mantis 13495 ---
		Документы.Scan_ПеремещениеИзделий.ОчиститьCDDфакт(ЭтотОбъект);
	// rarus tenkam 13.09.2018 mantis 13495 +++
	// Иначе
	ИначеЕсли ТекРежимЗаписиДокумента = РежимЗаписиДокумента.Проведение Тогда
	// rarus tenkam 13.09.2018 mantis 13495 ---
		Документы.Scan_ПеремещениеИзделий.УстановитьCDDфакт(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры
//rarus tenkam 23.03.2017 mantis 7179 ---

// rarus tenkam 17.06.2019 mantis 14476 +++ 
Процедура ОбработкаУдаленияПроведения(Отказ)
	ЕстьДвижения = Ложь;
	Для Каждого ТекСтрока Из ИзделияДляПеремещения Цикл
		ЕстьДвижения = РегистрыНакопления.Scan_МестонахождениеИзделий.ЕслиДвиженияПослеРегистратора(ТекСтрока.Изделие, Ссылка, ТекСтрока.ДатаПолучения);
		Если ЕстьДвижения Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьДвижения Тогда
		Отказ = Истина;
		Сообщить("У продуктов документа есть перемещения, созданные позже даты прихода"); 
	КонецЕсли;			
КонецПроцедуры
// rarus tenkam 17.06.2019 mantis 14476 ---
